 DROP TABLE sklad;
 CREATE TABLE sklad (
NameProd                         char(50), 
Producer                         char(20), 
Transport                        char(20), 
Fridge                           char(15), 
Sklad                            char(15), 
Date                             date, 
Lot                              char(10), 
Packing                          char(15), 
Weight_place                     char(15), 
N_Items                          real, 
Net_weight                       real, 
Gross_weight                     real, 
Comment                          char(150), 
Color                            integer);
insert into sklad values('Горбуша ПБГ','ВАЗИКОВ','Автомашина 1','Уссури-холод','БН','2012-10-30','58','мешок','22','2730.00','60060.00','63063.00','ХРАНЕНИЕ БЕТАРК','65535');
insert into sklad values('Горбуша ПБГ','ВАЗИКОВ','Автомашина 2','Уссури-холод','БН','2012-10-31','58','мешок','22','778.00','17116.00','17971.00','ХРАНЕНИЕ БЕТАРК','65535');
insert into sklad values('Горбуша ПБГ','ВАЗИКОВ','Фрост Олимпос','ДКХ 32','399330','2012-10-18','58','мешок','22','456.00','10032.00','10533.60','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','16776960');
insert into sklad values('Горбуша ПБГ','ВАЗИКОВ','Фрост Олимпос','ДКХ 32','399330','2013-10-18','58 ДРРЫ','мешок','22','68.00','1496.00','1570.80','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.  ДАРЫ МОРЯ          ХРАНЕНИЕ ООО РПК "БЕТАРК"','16776960');
insert into sklad values('Горбуша ПБГ','ВАЗИКОВ','Фрост Олимпос','ДКХ 35','399326','2012-10-17','58 ДАРЫ','мешок','22','200.00','4400.00','4620.00','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.  ДАРЫ МОРЯ          ХРАНЕНИЕ ООО РПК "БЕТАРК"','16776960');
insert into sklad values('Горбуша ПБГ','ВАЗИКОВ','Фрост Олимпос','ДКХ 35','399327','2012-10-18','58 ДАРЫ','мешок','22','1140.00','25080.00','26334.00','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.  ДАРЫ МОРЯ          ХРАНЕНИЕ ООО РПК "БЕТАРК"','16776960');
insert into sklad values('Горбуша ПБГ','РАККТ','Автомашина 1','Уссури-холод','БН','2012-10-15','БП','мешок','20','150.00','3000.00','3150.00','','65535');
insert into sklad values('Горбуша ПБГ','РАККТ','Автомашина 2','Уссури-холод','БН','2012-10-16','БП','мешок','20','3014.00','60280.00','63294.00','','65535');
insert into sklad values('Горбуша ПБГ','РАККТ','Автомашина 3','Уссури-холод','БН','2012-12-11','БП','мешок','20','2892.00','57840.00','60732.00','','65535');
insert into sklad values('Горбуша ПБГ','РАККТ','Автомашина 4','Уссури-холод','БН','2012-12-12','БП','мешок','20','2908.00','58160.00','61068.00','','65535');
insert into sklad values('Горбуша ПБГ','РАККТ','Автомашина 5','Уссури-холод','БН','2012-12-13','БП','мешок','20','2724.00','54480.00','57204.00','','65535');
insert into sklad values('Горбуша ПБГ','РАККТ','Фрост Олимпос','ДКХ 150','399297','2012-10-15','Кон №15','мешок','20','631.00','12620.00','13251.00','','16776960');
insert into sklad values('Горбуша ПБГ 4кат','РАККТ','АВТОМАШИНА','ТРАСТ','БН','2012-12-18','4кат','мешок','20','1148.00','22960.00','24108.00','','16711935');
insert into sklad values('Горбуша ПСГ','ВАЗИКОВ','ПЛУТОНАС','ВМРП 213','2157','2012-10-31','56','мешок','22','190.00','4180.00','4389.00','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.    ЗУБАТКА','');
insert into sklad values('Горбуша ПСГ','ВАЗИКОВ','Фрост Олимпос','ДКХ 26','399333','2012-10-18','57','мешок','22','53.00','1166.00','1224.30','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','16776960');
insert into sklad values('Горбуша ПСГ','РАККТ','Автомашина','ВМРП 211','239','2013-02-12','БРАК','мешок','20','57.00','1140.00','1197.00','БРАК','');
insert into sklad values('Горбуша ПСГ','РАККТ','Фрост Олимпос','ДКХ 22','399495','2012-10-15','Кон №34','мешок','20','112.00','2240.00','2352.00','','16776960');
insert into sklad values('Горбуша ПСГ','РАККТ','Фрост Олимпос','ДКХ 47','399245','2012-10-12','Кон №25','мешок','20','1115.00','22300.00','23415.00','','16776960');
insert into sklad values('Горбуша ПСГ','РАККТ','Фрост Олимпос','ДКХ 47','399271','2012-10-14','Кон №15','мешок','20','2016.00','40320.00','42336.00','','16776960');
insert into sklad values('Икра горб.   соленая','ИП Борисик А.П.','Автомашина','ДКХ 05','144455','2013-02-05','БП','ящик','14,040','3.00','42.12','46.75','','16776960');
insert into sklad values('Икра кеты.  соленая','ИП Борисик А.П.','Автомашина','ДКХ 05','144456','2013-02-05','БП','ящик','14,040','5.00','70.20','77.92','','16776960');
insert into sklad values('Икра лосос.соленая','ИП Борисик А.П.','Автомашина','ДКХ 05','144457','2012-02-05','БП','ящик','14,040','1.00','14.04','15.58','1ящ.икра горбуши 52банки=кета 32 банки','16776960');
insert into sklad values('Кета ПБГ','ВАЗИКОВ','ПЛУТОНАС','ВМРП 213','2143','2012-10-30','50 1cорт','мешок','19,922','68.00','1354.70','1422.08','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','');
insert into sklad values('Кета ПБГ','РАККТ','ОРИОН','ВМРП 211','1605','2012-08-21','Кон№14-06','мешок','20','65.00','1300.00','1365.00','','');
insert into sklad values('Кета ПБГ','РАККТ','ПЛУТОНАС','ВМРП 221','2173','2012-11-04','Кон №64','мешок','20','47.00','940.00','987.00','','');
insert into sklad values('Кета ПБГ','РАККТ','ПЛУТОНАС','ВМРП 241','2173','2012-11-04','Кон №71','мешок','20','467.00','9340.00','9807.00','','');
insert into sklad values('Кета ПБГ','РАККТ','СМОЛЬНИНСКИЙ','ДКХ 33','373879','2012-10-04','Кон №23/07','мешок','20','341.00','6820.00','7161.00','','16776960');
insert into sklad values('Кета ПБГ','РАККТ','Фрост Олимпос','ДКХ 45','373933','2012-10-14','Кон №15','мешок','20','287.00','5740.00','6027.00','','16776960');
insert into sklad values('Кета ПБГ','РАККТ','Фрост Олимпос','ДКХ 47','373900','2012-10-12','Кон №25','мешок','20','246.00','4920.00','5166.00','','16776960');
insert into sklad values('Кета ПБГ','РАККТ','Фрост Олимпос','ДКХ 47','373901','2012-10-13','Кон №34','мешок','20','185.00','3700.00','3885.00','','16776960');
insert into sklad values('Кета ПБГ Р/В','ВАЗИКОВ','Фрост Олимпос','ДКХ 26','373922','2012-10-18','50 1сорт','мешок','20,09947','20.00','401.99','422.00','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','16776960');
insert into sklad values('Кета ПБГ Р/В','ВАЗИКОВ','Фрост Олимпос','ДКХ 31','373920','2012-10-18','53 сандарт','мешок','19,6059','68.00','1333.20','1400.00','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','16776960');
insert into sklad values('Кета ПБГ Р/В','ВАЗИКОВ','Фрост Олимпос','ДКХ 31','373921','2012-10-18','50 1сорт','мешок','20,09947','567.00','11396.40','11966.20','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','16776960');
insert into sklad values('Кета ПБГ ШТ.мор','ВАЗИКОВ','ПЛУТОНАС','ВМРП 213','2157','2012-10-31','стандарт','ящик','27','9.00','243.00','269.73','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','');
insert into sklad values('Кета ПБГ ШТ.мор.','ВАЗИКОВ','Фрост Олимпос','ДКХ 18','373913','2012-10-15','К','ящик','27','179.00','4833.00','5364.63','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','16776960');
insert into sklad values('Кета ПБГ ШТ.мор.','ВАЗИКОВ','Фрост Олимпос','ДКХ 18','373913','2012-10-15','КУ','ящик','27','27.00','729.00','809.19','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','16776960');
insert into sklad values('Корюшка  НР','ВАЗИКОВ','ПЛУТОНАС','ВМРП 213','2143','2012-10-30','6','мешок','22','784.00','17248.00','18110.40','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','');
insert into sklad values('Корюшка  НР','ВАЗИКОВ','СМОЛЬНИНСКИЙ','ВМРП 243','2273','2012-11-13','6','мешок','22','512.00','11264.00','11827.20','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','');
insert into sklad values('Корюшка НР','РАККТ','АМУР-ЛИМАН','ДКХ 45','250238','2012-11-30','Кон №50/07','мешок','20','1118.00','22360.00','23478.00','','16776960');
insert into sklad values('Нерка БГ ШТ.мор','ВАЗИКОВ','ПЛУТОНАС','ВМРП 213','2157','2012-10-31','155','мешок','19,358','1.00','19.36','20.32','ХРАНЕНИЕ ИП ВАЗИКОВ И.К. СОЛЕНАЯ','');
insert into sklad values('Нерка ПБГ','ВАЗИКОВ','ПЛУТОНАС','ВМРП 213','2157','2012-10-31','55','мешок','22','667.00','14674.00','15407.70','ХРАНЕНИЕ ИП ВАЗИКОВ И.К.','');
insert into sklad values('Нерка ПБГ 2М','РАККТ','ОРИОН','ВМРП 221','1636','2012-08-24','Кон№05-06','мешок','20','45.00','900.00','945.00','','');
insert into sklad values('Нерка ПБГ < 1кг','РАККТ','Автомашина','ВМРП 211','129','2013-01-23','БП','мешок','15','2.00','30.00','31.50','БРАК мешки нарушены','');
insert into sklad values('Нерка ПБГ < 1кг','РАККТ','Автомашина','ВМРП 211','129','2013-01-23','БП','мешок','20','98.00','1960.00','2058.00','БРАК','');
insert into sklad values('Нерка ПБГ S','РАККТ','ОРИОН','ВМРП 241','1651','2012-08-27','Кон№01-06','мешок','20','19.00','380.00','399.00','','');
insert into sklad values('Нерка ПСГ  < 1кг','РАККТ','Автомашина','ВМРП 211','129','2013-01-23','БП','мешок','20','26.00','520.00','546.00','БРАК','');
insert into sklad values('Нерка ПСГ  < 1кг','РАККТ','Автомашина','ВМРП 211','2536','2012-12-18','БП','мешок','10','5.00','50.00','52.50','БРАК','');
insert into sklad values('Нерка ПСГ  < 1кг','РАККТ','Автомашина','ВМРП 211','2536','2012-12-18','БП','мешок','20','30.00','600.00','630.00','БРАК','');
insert into sklad values('Треска БГ L','РАККТ','АМУР-ЛИМАН','ДКХ 22','325337','2012-11-29','Кон №50/07','мешок','20','1285.00','25700.00','26985.00','','16776960');
insert into sklad values('Треска БГ L','РАККТ','ПЛУТОНАС','ВМРП 241','147','2012-11-03','Кон №70','мешок','20','370.00','7400.00','7770.00','ДАРЫ МОРЯ','');
